void main( ) {

  // 문자열 :  ''  흑은 "" 로 표시
  print('안녕하세요');
  print("아기상어 뚜루루 뚜루");  //print()  마다 자동개행
  // print("나는 무너        줄바꿈을 단순 enter 키로 불가
  // 꿈을 꾸는 무너"); 

  print(123);       //숫자(정수)
  print(123.456);   //숫자(실수)
  print(123+456);   //숫자 연산 가능
  print('123');     //문자
  //print('123'+456);
  print('123'+'456');     //문자열 결합
  print(true);    //참, 거짓
  print(false);    //참, 거짓
  //print(abcd);

  //  주석 : 코드 실행에 영향을 주지않는 부분
  //         설명이나 작업지시 내용을 기재
  //  한줄 주석  : 주석 표시 이후 1줄만 주석으로 처리
  //print(안녕하세요);   변수명 혹은 명령어로 인지하여 에러발생
  
  /*  --> 주석 시작
       
        주석 구간

  주석 끝 <--   */

  /*
  \"  -> 글자로 취급
  \'  -> 글자로 취급
  \t   TAB
  \n   개행
   */

  print('나폴레옹은 "불이야!"라고 외쳤다');
  print("나폴레옹은 '어? 이산이 아닌데?'라고 생각했다");
  print("나폴레옹은 \"예전에 \'이 산인가?\'라고 생각했었다니까?\" 라고 말했다");
  print("아기상어\t뚜루루뚜루\n바닷속\t뚜루루뚜루\n귀여운\t뚜루루뚜루\n아기상어\t뚜루루뚜루 ");
  print('月火');
  print('🧡🅰💕🐱‍🚀↖↟ɑ₉Ϛ◦◯');
}